using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace YaProdayu2.Sysyem.Utils
{
    public class DictionaryThemes
    {
        public List<Theme> List { get; set; }

        public DictionaryThemes()
        {
            this.List = new List<Theme>();

            this.List.Add(new Theme() 
            {
                Image = "1.png",
                Key = "Авто, Автоперевозки",
                SubThemes = new List<string>()
                {
                    "<d>Поиск запчасти к авто",
                    "Ищу зап.часть для кузова",
                    "Ищу зап.часть  двигателя",
                    "Ищу зап.часть электронного оборудования",
                    "Ищу зап.часть для ККП,АКПП",
                    "ищу зап.часть для ходовой",
                    "Ищу зап.часть  салона",
                    "Ищу  зап.часть для тюнинга",
                    "<d>Ремонт,тюнинг авто",
                    "Ищу специалиста по кузову",
                    "Ищу специалиста по двигателю",
                    "Ищу специалиста по авто-электрике",
                    "Ищу специалиста по КПП,АКПП",
                    "Ищу специалиста ходовой",
                    "Ищу специалиста по салону",
                    "Ищу специалиста по тюнингу",
                    "<d>Автоперевозки - пассажирские, грузовые",
                    "Автоперевозки грузовые до 3.5 тонн",
                    "Автоперевозки грузовые от 3.5 тонн и выше",
                    "Автоперевозки пассажирские  до 15-20 человек",
                    "Автоперевозки пассажирские от 20 человек и выше",
                    "Ищу водителя с л/а на короткий срок"
                }
            });

            this.List.Add(new Theme()
            {
                Image = "2.png",
                Key = "Недвижимость-сделки, Аренда",
                SubThemes = new List<string>()
                {
                    "<d>Квартиры",
                    "Хочу купить, продать квартиру",
                    "Хочу снять квартиру на несколько месяцев",
                    "Хочу снять квартиру посуточно",
                    "<d>Коттеджи,дома,дачи",
                    "Хочу арендовать котедж, загородный дом, дачу",
                    "Хочу купить, продать коттедж, дачу, дом",
                    "<d>Коммерческая недвижимость, земля",
                    "Хочу взять в аренду коммерческую недвижимость",
                    "Хочу купить, продать коммерческую недвижимость",
                    "Хочу купить землю в аренду",
                    "Хочу купить земельный участок(под любые цели)"
                }
            });

            this.List.Add(new Theme()
            {
                Image = "3.png",
                Key = "Услуги кредитования",
                SubThemes = new List<string>()
                {
                    "Поиск кредита, займу деньги в долг"
                }
            });

             this.List.Add(new Theme()
            {
                Image = "4.png",
                Key = "Аренда, прокат",
                SubThemes = new List<string>()
                {
                    "Авто, мото",
                    "Спецтехника",
                    "Инструменты, электростанции итд",
                    "Лодки, яхты, теплоходы",
                    "Легкомоторные самолеты",
                    "Свадебные платья",
                    "Карнавальные, исторические костюмы",
                    "Спортивный инвентарь",
                    "Туристический инвентарь",
                    "Звуковая-световая аппаратура"
                }
            });

             this.List.Add(new Theme()
            {
                Image = "5.png",
                Key = "Репетиторы"
                ,
                SubThemes = new List<string>()
                {
                    "Поиск репетитора по математике, алгебре",
                    "Поиск репетитора по геометрии",
                    "Поиск репетитора по физике",
                    "Поиск репетитора по химии",
                    "Поиск репетитора по русскому языку",
                    "Поиск репетитора по английскому языку",
                    "Поиск репетитора по французскому языку",
                    "Поиск репетитора по немецкому языку",
                    "Поиск репетитора по испанскому языку",
                    "Поиск репетитора по китайскому языку",
                    "Поиск репетитора по японскому языку",
                    "Поиск репетитора по другим языкам "
                }
            });

             this.List.Add(new Theme()
            {
                Image = "6.png",
                Key = "Деловые услуги для бизнеса",
                SubThemes = new List<string>()
                {
                    "Мне нужен юрист, адвокат",
                    "Мне нужен бухгалтер, аудитор",
                    "Мне нужен эксперт , оценщик",
                    "Мне нужен специалист патентного права",
                    "Мне нужен программист (без уточнения направления)",
                    "Мне нужен дизайнер (все направления)",
                    "Мне нужен по страхованию",
                    "Мне нужна реклама, PR , размещение, раскрутка , промоутеры итд",
                    "Мне нужен переводчик ",
                    "Мне нужен интернет , IT ,связь",
                    "Мне нужны услуги охранного предприятия, телохранитель",
                    "Мне нужна организация встреч, презентаций, конференций итд",
                    "Мне нужна полиграфия, печать, лазерная резка итд",
                    "Мне нужны услуги сео оптимизации и интернет рекламы",
                    "Мне нужно изготовление спец одеды"
                }
            });

             this.List.Add(new Theme()
            {
                Image = "7.png",
                Key = "Услуги частным лицам",
                SubThemes = new List<string>()
                {
                    "Услуги адвоката,юриста",
                    "Независимый эксперт ,оценщик",
                    "Дизайнер (все направления)",
                    "Услуги подключения ТВ, интернет",
                    "Фото, видео-сьемка",
                    "Услуги грузчиков, помощь при переезде",
                    "Прочие услуги"
                }
            });

             this.List.Add(new Theme()
            {
                Image = "8.png",
                Key = "Строительство, ремонт ,подключение",
                SubThemes = new List<string>()
                {
                    "Отделка, ремонт -квартир, офисов, помещений",
                    "Отделочные работы фасада, внешних элементов зданий",
                    "Строительство домов, коттеджей, дач",
                    "Строительство, ремонт бань",
                    "Промышленный альпинизм",
                    "Прочие объекты и тех.задания",
                    "Строительство каминов, печей",
                    "Установка ,ремонт окон",
                    "Установка, ремонт дверей",
                    "Работы связанные с потолками стенами, полами",
                    "Сантехника -установка, планировка, ремонт, материалы",
                    "Дерево -брус, бревно,  доска  итд",
                    "Электро-техника, освещение",
                    "Все для покраски",
                    "Системы вентиляции, кондиционеры"
                }
            });

             this.List.Add(new Theme()
            {
                Image = "9.png",
                Key = "Мне нужен мастер, что-то сделать, починить",
                SubThemes = new List<string>()
                {
                    "Мастер сантехник",
                    "Мастер электрик",
                    "Мастер по ремонту холодильников",
                    "Мастер по ремонту стиральных машин",
                    "Мастер по ремонту теле-радио аппаратуры",
                    "Мастер по ремонту СВЧ печей",
                    "Мастер по ремонту и настройке компьютеров",
                    "Мастер по ремонту, сбору мебели",
                    "Мастер ювелирных изделий",
                    "Мастер электро, газосварщик ",
                    "Прочие услуги",
                    "МУЖ НА ЧАС -то что не под силу дамам по хозяйству"
                   
                  
                }
            });

            this.List.Add(new Theme()
            {
                Image = "10.png",
                Key = "У меня праздник, событие, корпоратив",
                SubThemes = new List<string>()
                {
                    "Поиск ведущего,тамады",
                    "Поиск d/j, звукооператора, аппаратура",
                    "Поиск фотографа",
                    "Поиск видео-оператора",
                    "Поиск Услуги кавер-группы,живой звук",
                    "Поиск фокусника, иллюзиониста",
                    "Поиск актеров-аниматоров",
                    "Поиск шоу-балета",
                    "Поиск Шоу мыльных пузырей",
                    "Поиск артистов Огненного шоу", 
                    "Выездная регистрация",
                    "Дед  Мороз, Снегурочка", 
                    "Украшение  залов"
                }
            });
              
            
            this.List.Add(new Theme()
            {
                Image = "11.png",
                Key = "Красота и здоровье",
                SubThemes = new List<string>()
                {
                    "Услуги парикмахера",
                    "Услуги визажиста",
                    "Ногтевой сервис",
                    "Услуги массажиста",
                    "Мастер по эпиляции",
                    "Наращивание волос, ресниц  итд",
                    "Солярий",
                    "Тату мастер",
                    "Хочу похудеть",
                    "Медицинские услуги частных клиник",
                    "Услуги частных стоматологических клиник"
                    
                }
            });
            this.List.Add(new Theme()
            {
                Image = "12.png",
                Key = "Собираемся на отдых, в командировку",
                SubThemes = new List<string>()
                {
                    "<d>Хотим на отдых  за  груницу",
                    "Поиск, подбор тура у тур.фирм за границу",
                    "Поиск, подбор речного, морского круиза",
                    "<d>Еду в командировку -ищу где остановиться",
                    "Мне нужен номер в отеле",
                    "Мне нужен номер в гостинице",
                    "Мне нужно место в  хостеле",
                    "Мне нужна квартира, комната в другом городе",
                    "<d>Едем отдыхать на Черное море",
                    "Ищу комнату в частном доме ",
                    "Ищу номер в гостинице, отеле "
                }
            });

            this.List.Add(new Theme()
            {
                Image = "13.png",
                Key = "Заказ банкетов, выездное питание, продукты питания",
                SubThemes = new List<string>()
                {
                    "Поиск кафе,ресторан  для проведения банкета",
                    "Выбор, заказ столика в кафе,ресторанах",
                    "Нужно накормить группу людей,тур.группу,спорт команду итд",
                    "Выездное питание (повара,официанты,посуда,оборудование)",
                    "Продукты питания (поиск поставщика)",
                    "Торты,выпечка на заказ"
                }
            });

            this.List.Add(new Theme()
            {
                Image = "14.png",
                Key = "Товары",
                SubThemes = new List<string>()
                {
                    "<d>Категория товаров временно отсутсвует"
                }
            });
        }
    }
}