using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace YaProdayu2.Y2System.Utils
{
    public class DictionaryThemes
    {
        public List<Theme> List { get; set; }

        public DictionaryThemes()
        {
            this.List = new List<Theme>();

            this.List.Add(new Theme() 
            {
                Image = "1.png",
                Key = "Авто, Автоперевозки",
                SubThemes = new List<string>()
                {
                    "<d>Ищу зап.часть к авто ",
                    "Ищу зап.часть для кузова",
                    "Ищу зап.часть  двигателя",
                    "Ищу зап.часть электронного оборудования",
                    "Ищу зап.часть для ККП,АКПП",
                    "ищу зап.часть для ходовой",
                    "Ищу зап.часть  салона",
                    "Ищу шины, диски новые, б/у",
                    "Ищу  зап.часть для тюнинга",
                    "<d>",
                    "Куплю продам авто на разбор",
                    "<d>Ремонт, тюнинг авто",
                    "Ищу специалиста по кузову (ремонт после дтп,покраска итд)",
                    "Ищу специалиста по двигателю",
                    "Ищу специалиста по авто-электрике",
                    "Ищу специалиста по КПП,АКПП",
                    "Ищу специалиста ходовой",
                    "Ищу специалиста по салону",
                    "Ищу  зап.часть для тюнинга",
                    "<d>",
                    "Востановить авто после дтп",
                    "<d>Автоперевозки - пассажирские, грузовые",
                    "Автоперевозки грузовые до 3.5 тонн",
                    "Автоперевозки грузовые от 3.5 тонн и выше",
                    "Автоперевозки пассажирские  до 15-20 человек",
                    "Автоперевозки пассажирские от 20 человек и выше",
                    "Ищу водителя с л/а на короткий срок"
                }
            });

            this.List.Add(new Theme()
            {
                Image = "2.png",
                Key = "Недвижимость-сделки, Аренда",
                SubThemes = new List<string>()
                {
                    "<d>Квартиры",
                    "Хочу купить, продать квартиру",
                    "Хочу снять квартиру, комнату на несколько месяцев",
                    "Хочу снять квартиру на несколько часов, суток",
                    "<d>Коттеджи, дома, дачи, участки",
                    "Хочу арендовать котедж, загородный дом, дачу",
                    "Хочу купить, коттедж, дачу, дом",
                    "Хочу купить,  земельный  участок",
                    "<d>Коммерческая недвижимость, земля",
                    "Хочу взять в аренду,купить, офисное помещение",
                    "Хочу взять в аренду коммерческую недвижимость",
                    "Хочу купить, коммерческую недвижимость",
                    "Хочу купить землю в аренду",
                    "Хочу купить земельный участок(под любые цели)"
                }
            });

            this.List.Add(new Theme()
            {
                Image = "3.png",
                Key = "Услуги кредитования",
                SubThemes = new List<string>()
                {
                    "Поиск кредита , микро-займ"
                }
            });

             this.List.Add(new Theme()
            {
                Image = "4.png",
                Key = "Аренда, прокат",
                SubThemes = new List<string>()
                {
                    "Авто, мото",
                    "Спецтехника",
                    "Инструменты, электростанции итд",
                    "Лодки, яхты, теплоходы",
                    "Легкомоторные самолеты",
                    "Свадебные платья",
                    "Карнавальные, исторические костюмы",
                    "Спортивный инвентарь",
                    "Туристический инвентарь",
                    "Звуковая-световая аппаратура",
                    "фото,видео камеры,студийное оборудование в аренду, студии"
                }
            });

             this.List.Add(new Theme()
            {
                Image = "5.png",
                Key = "Репетиторы"
                ,
                SubThemes = new List<string>()
                {
                    "Поиск репетитора по математике, алгебре",
                    "Поиск репетитора по геометрии",
                    "Поиск репетитора по физике",
                    "Поиск репетитора по химии",
                    "Поиск репетитора по английскому языку",
                    "Поиск репетитора по французскому языку",
                    "Поиск репетитора по немецкому языку",
                    "Поиск репетитора по испанскому языку",
                    "Поиск репетитора по китайскому языку",
                    "Поиск репетитора по японскому языку",
                    "Поиск репетитора по другим языкам ",
                    "Прочие консультации по разным дисциплинам"
                }
            });

             this.List.Add(new Theme()
            {
                Image = "6.png",
                Key = "Деловые услуги для бизнеса",
                SubThemes = new List<string>()
                {
                    "<d>Правовая  защита интересов бизнеса",
                    "Мне нужен юрист, адвокат по гражданским делам",
                    "Мне нужен юрист, адвокат  по уголовным делам",
                    "Мне нужен юрист, адвокат  по административным делам",
                    "Мне нужен юрист, адвокат  по трудовым спорам",
                    "Мне нужен юрист, адвокат  по корпоративным спорам",
                    "<d>Прочие услуги для бизнеса",
                    "Мне нужен бухгалтер, аудитор",
                    "Мне нужно открыть/закрыть ИП,ООО",
                    "Мне нужен эксперт , оценщик",
                    "Мне нужен специалист патентного права",
                    "Мне нужен программист, web разработка,web-дизайн",
                    "Мне нужен дизайнер (все направления)",
                    "Мне нужен специалист по страхованию",
                    "Мне нужно разработать фирменный стиль,создать логотип",
                    "Мне нужна реклама, PR , размещение, раскрутка , промоутеры итд",
                    "Мне нужен переводчик (перевод литературы, перевод переговоров,встречи) ",
                    "Мне нужен интернет , IT ,связь",
                    "Мне нужен архитектор, инженер",
                    "Мне нужны услуги охранного предприятия, телохранитель",
                    "Мне нужна организация встреч, презентаций, конференций итд",
                    "Мне нужна полиграфия, печать, лазерная резка ,рекламная продукция итд",
                    "Мне нужны услуги сео оптимизации, реклама в интернете",
                    "Мне нужно изготовление спец. одежды" 
                }
            });

             this.List.Add(new Theme()
            {
                Image = "7.png",
                Key = "Услуги частным лицам",
                SubThemes = new List<string>()
                {
                    "<d>Мне нужна консультация или  защита юриста /адвоката",
                    "Мне нужен юрист, адвокат по гражданским делам",
                    "Мне нужен юрист, адвокат  по уголовным делам",
                    "Мне нужен юрист, адвокат  по административным делам",
                    "<d>Прочие услуги частным лицам",
                    "Независимый эксперт ,оценщик",
                    "Дизайнер (все направления)",
                    "Услуги подключения ТВ, интернет",
                    "Фото, видео-сьемка",
                    "Ищу няню , сиделку",
                    "Услуги грузчиков, помощь при переезде"
                }
            });

             this.List.Add(new Theme()
            {
                Image = "8.png",
                Key = "Строительство, ремонт ,подключение",
                SubThemes = new List<string>()
                {
                    "Отделка, ремонт -квартир, офисов, помещений",
                    "Отделочные работы фасада, внешних элементов зданий",
                    "Строительство домов, коттеджей, дач",
                    "Строительство, ремонт бань",
                    "Промышленный альпинизм",
                    "Прочие объекты и тех.задания",
                    "Строительство каминов, печей",
                    "Мне нужен архитектор, инженер",
                    "<d>",
                    "Установка ,ремонт окон",
                    "Установка, ремонт дверей",
                    "Работы связанные с потолками стенами, полами",
                    "Сантехника -установка, планировка, ремонт, материалы",
                    "Дерево -брус, бревно,  доска  итд",
                    "Электро-техника, освещение",
                    "Все для покраски",
                    "Системы слежения и видеофиксации",
                    "Системы вентиляции, кондиционеры"
                }
            });

             this.List.Add(new Theme()
            {
                Image = "9.png",
                Key = "Мне нужен мастер, что-то сделать, починить",
                SubThemes = new List<string>()
                {
                    "Мастер сантехник",
                    "Мастер электрик",
                    "Мастер по ремонту холодильников",
                    "Мастер по ремонту стиральных машин",
                    "Мастер по ремонту теле-радио аппаратуры",
                    "Мастер по ремонту СВЧ печей",
                    "Мастер по ремонту и настройке компьютеров",
                    "Мастер по ремонту, сбору мебели",
                    "Мастер ювелирных изделий",
                    "Мастер электро, газосварщик ",
                    "Мастер -работа с металлом (станки, литье, ковка итд)",
                    "Мастер -работа с деревом (весь спектр работ) ",
                    "Прочие услуги",
                    "МУЖ НА ЧАС -то что не под силу дамам по хозяйству"
                   
                  
                }
            });

            this.List.Add(new Theme()
            {
                Image = "10.png",
                Key = "У меня праздник, событие, корпоратив",
                SubThemes = new List<string>()
                {
                    "Поиск ведущего,тамады",
                    "Поиск d/j, звукооператора, аппаратура",
                    "Поиск фотографа",
                    "Поиск видео-оператора",
                    "Поиск Услуги кавер-группы,живой звук",
                    "Поиск фокусника, иллюзиониста",
                    "Поиск актеров-аниматоров",
                    "Поиск шоу-балета",
                    "Поиск Шоу мыльных пузырей",
                    "Поиск артистов светового, огненного шоу", 
                    "Выездная регистрация",
                    "Дед  Мороз, Снегурочка", 
                    "Украшение  залов", 
                    "Где мне отметить? - банкетные залы,кафе итд"
                }
            });
              
            
            this.List.Add(new Theme()
            {
                Image = "11.png",
                Key = "Красота и здоровье",
                SubThemes = new List<string>()
                {
                    "Услуги парикмахера",
                    "Услуги визажиста",
                    "Ногтевой сервис",
                    "Услуги массажиста",
                    "Мастер по эпиляции",
                    "Наращивание волос, ресниц  итд",
                    "Солярий",
                    "Тату мастер",
                    "Продажа косметики"
                    
                }
            });
            this.List.Add(new Theme()
            {
                Image = "12.png",
                Key = "Собираемся на отдых, в командировку",
                SubThemes = new List<string>()
                {
                    "<d>Хотим на отдых  за  границу",
                    "Поиск, подбор тура у тур.фирм за границу",
                    "Поиск, подбор речного, морского круиза",
                    "<d>Еду в командировку -ищу где остановиться",
                    "Мне нужен номер в отеле",
                    "Мне нужен номер в гостинице",
                    "Мне нужно место в  хостеле",
                    "Мне нужна квартира, комната в другом городе",
                    "<d>Едем отдыхать на наши курорты, Черное море",
                    "Хочу снять комнату в частном доме ",
                    "Хочу снять номер в мини-гостинице, отеле "
                }
            });

            this.List.Add(new Theme()
            {
                Image = "13.png",
                Key = "Заказ банкетов, выездное питание, продукты питания",
                SubThemes = new List<string>()
                {
                    "<d>Хочу закатить банкет",
                    "Ищу кафе чтобы  организовать банкет/фуршет", 
                    "Ищу ресторан чтобы организовать банкет/фуршет",
                    "Ищу загородный дом чтобы организовать банкет/фуршет",
                    "Ищу банкетный зал чтобы организовать банкет/фуршет", 
                    "<d>Выездное питание,обслуживаниние",
                    "Нужен повар",
                    "Нужны официанты",
                    "Нужна команда поваров, официантов с оборудованием или без",
                    "<d>",
                    "Нужно накормить -тур.группу,спорт. команду, школьную группу итд",
                    "<d>",
                    "Поиск поставщиков продуктов питания (все направления)",
                    "<d>",
                    "Торты,выпечка на заказ"
                }
            });

            this.List.Add(new Theme()
            {
                Image = "14.png",
                Key = "Товары",
                SubThemes = new List<string>()
                {
                    "<d>Категория \"товары\" в разработке"
                }
            });
        }
    }
}